MPU Messenger/MPU Messenger/bin/Debug/MPU Mesajları/AddVariables - Kopya.txt

<?xml version="1.0" encoding="utf-8"?>
    <soap:Envelope
        xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"
        xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
        xmlns:xsd="http://www.w3.org/2001/XMLSchema">
        <soap:Body>
            <AddVariables
                xmlns="http://transport.alstom.com/webservices/extendedSymbolism">
                <SetOfVariablesToAdd>
                  <VariableToAdd>
                        <SymbolicName>/MPU_taskmpu/drs1/VB_DRS_DoorOpen_A1</SymbolicName>
                        <ProdId>
                            1
                            </ProdId>
                        <Size>
                            1
                            </Size>
                        <Type>
                            TBOOL
                            </Type>
                        <Reference>
                            4355
                            </Reference>
                        <ReferenceCB>
                            0
                            </ReferenceCB>
                        </VariableToAdd>
                  <VariableToAdd>
                        <SymbolicName>/MPU_taskmpu/drs1/VB_DRS_DoorOpen_A2</SymbolicName>
                        <ProdId>
                            1
                            </ProdId>
                        <Size>
                            1
                            </Size>
                        <Type>
                            TBOOL
                            </Type>
                        <Reference>
                            4358
                            </Reference>
                        <ReferenceCB>
                            0
                            </ReferenceCB>
                        </VariableToAdd>
		          <VariableToAdd>
                        <SymbolicName>/MPU_taskmpu/drs1/VB_DRS_DoorOpen_C1</SymbolicName>
                        <ProdId>
                            1
                            </ProdId>
                        <Size>
                            1
                            </Size>
                        <Type>
                            TBOOL
                            </Type>
                        <Reference>
                            4357
                            </Reference>
                        <ReferenceCB>
                            0
                            </ReferenceCB>
                        </VariableToAdd>
                  <VariableToAdd>
                        <SymbolicName>/MPU_taskmpu/drs1/VB_DRS_DoorOpen_B1</SymbolicName>
                        <ProdId>
                            1
                            </ProdId>
                        <Size>
                            1
                            </Size>
                        <Type>
                            TBOOL
                            </Type>
                        <Reference>
                            4356
                            </Reference>
                        <ReferenceCB>
                            0
                            </ReferenceCB>
                        </VariableToAdd>
                  <VariableToAdd>
                        <SymbolicName>/MPU_taskmpu/drs1/open_ext_drs1/VB_DRS_OpenDoorsLeft</SymbolicName>
                        <ProdId>
                            1
                            </ProdId>
                        <Size>
                            1
                            </Size>
                        <Type>
                            TBOOL
                            </Type>
                        <Reference>
                            4409
                            </Reference>
                        <ReferenceCB>
                            0
                            </ReferenceCB>
                        </VariableToAdd>
				  <VariableToAdd>
                        <SymbolicName>/MPU_taskmpu/drs1/open_ext_drs1/VB_DRS_OpenDoorsRight</SymbolicName>
                        <ProdId>
                            1
                            </ProdId>
                        <Size>
                            1
                            </Size>
                        <Type>
                            TBOOL
                            </Type>
                        <Reference>
                            4410
                            </Reference>
                        <ReferenceCB>
                            0
                            </ReferenceCB>
                        </VariableToAdd>
                  <VariableToAdd>
                        <SymbolicName>/MPU_taskmpu/drs1/release_ext_drs2/mpu_rel_ext_drs_trainline1/VB_DRS_TLLeftDrsReleased</SymbolicName>
                        <ProdId>
                            1
                            </ProdId>
                        <Size>
                            1
                            </Size>
                        <Type>
                            TBOOL
                            </Type>
                        <Reference>
                            4182
                            </Reference>
                        <ReferenceCB>
                            0
                            </ReferenceCB>
                        </VariableToAdd>
                  <VariableToAdd>
                        <SymbolicName>/MPU_taskmpu/drs1/release_ext_drs2/mpu_rel_ext_drs_trainline1/VB_DRS_TLRightDrsReleased</SymbolicName>
                        <ProdId>
                            1
                            </ProdId>
                        <Size>
                            1
                            </Size>
                        <Type>
                            TBOOL
                            </Type>
                        <Reference>
                            4181
                            </Reference>
                        <ReferenceCB>
                            0
                            </ReferenceCB>
                        </VariableToAdd>
                  <VariableToAdd>
                        <SymbolicName>/MPU_taskmpu/pai1/trigger_automatic_msg1/mpu_manage_distance_counter/VI_TBS_TrainSpeedKph</SymbolicName>
                        <ProdId>
                            1
                            </ProdId>
                        <Size>
                            1
                            </Size>
                        <Type>
                            TSHORT
                            </Type>
                        <Reference>
                            1277
                            </Reference>
                        <ReferenceCB>
                            1
                            </ReferenceCB>
                        </VariableToAdd>
				  <VariableToAdd>
                        <SymbolicName>/MPU_taskmpu/pai1/trigger_automatic_msg1/mpu_manage_distance_counter/VI_PAI_DistanceCounter</SymbolicName>
                        <ProdId>
                            1
                            </ProdId>
                        <Size>
                            1
                            </Size>
                        <Type>
                            TUSHORT
                            </Type>
                        <Reference>
                            29727
                            </Reference>
                        <ReferenceCB>
                            1
                            </ReferenceCB>
                        </VariableToAdd>
				  <VariableToAdd>
                        <SymbolicName>/MPU_taskmpu/evr1/DD_CMileageKm_1</SymbolicName>
                        <ProdId>
                            1
                            </ProdId>
                        <Size>
                            1
                            </Size>
                        <Type>
                            TULONG
                            </Type>
                        <Reference>
                            1034
                            </Reference>
                        <ReferenceCB>
                            1
                            </ReferenceCB>
                        </VariableToAdd>
                  <VariableToAdd>
                        <SymbolicName>/MPU_taskmpu/pai1/trigger_automatic_msg1/mpu_manage_distance_counter/VI_PAI_CurStationIdx</SymbolicName>
                        <ProdId>
                            1
                            </ProdId>
                        <Size>
                            1
                            </Size>
                        <Type>
                            TUCHAR
                            </Type>
                        <Reference>
                            29671
                            </Reference>
                        <ReferenceCB>
                            1
                            </ReferenceCB>
                        </VariableToAdd>
                 </SetOfVariablesToAdd>
            </AddVariables>
        </soap:Body>
    </soap:Envelope>
